{"How do I report troubling behavior of a student?": "If you have concerns about another student and wish to  report their behavior, you may contact the Dean of Students office at  972-883-6391.  If you are concerned about  the safety of a student who lives on campus, please contact the UT Dallas  Police Department at 972-883-2222 to have them perform a welfare check. If the  student does not live on campus, you may contact their local police department.  Per department policy, the Student Counseling Center is unable to perform welfare checks on students.", "Will my privacy be  protected?": "Laws  and ethical guidelines require that all interactions with the Student  Counseling Center, including content of your sessions, your records, scheduling  of or attendance at appointments, and progress in counseling are confidential.  No record of counseling is contained in any academic, educational or job  placement file. While information will not be released to anyone outside the  Student Counseling Center without your written permission, in order to provide  you with the best possible treatment, we may confer with clinical professionals  within the UT Dallas Student Counseling Center. \r\n          There are some exceptions to confidentiality.  Specifically, we are legally required to disclose information to:\r\n          \r\n            Protect you or someone else from imminent danger  (suicide or homicide)\r\n            Report suspected abuse of minors, the elderly, or  persons with disabilities\r\n            Respond to a court subpoena\r\n            If there is known or suspected sexual exploitation  of a client by a past therapist\r\n          \r\n          In any of these situations, your counselor would  reveal only the information needed to resolve the immediate crisis or risk of  danger. If your counselor believes you are in danger of hurting yourself or  others, your counselor may contact appropriate medical and/or legal  authorities.", "Is there a charge for  counseling services?": "Services are offered at no charge to currently enrolled  students (Excludes students who are only enrolled in online courses).", "How can I access community referrals if I am not able to get into the center during working hours?": "You can call 972-883-2575 or email Shelly Turner, Counseling  referral coordinator at [email protected] to receive community resources that you can access.", "Am I eligible to receive  counseling services over the summer if I am not enrolled?": "Yes,  if you meet the following criteria:\r\n      \r\n        Must have been enrolled in the spring semester\r\n        Will be enrolled in the fall semester\r\n        Pay a one-time medical services fee of $34.40 \r\n      \r\n      If you are only taking online courses, you will need to meet  the above criteria and pay the medical services fee.", "Who is eligible for  counseling services?": "The Student Counseling Center is available to UT Dallas students  who are enrolled in the current semester (Excludes students who are only enrolled in online courses).", "What can I expect  during my Initial Evaluation?": "During your first session, you will discuss your concerns and goals to assist both you  and your counselor about how you can best be helped. At the conclusion of your initial evaluation, you will be prescribed an individualized treatment plan as listed above.", "How can I better  understand my insurance benefits?": "You can call 972-883-2575 or email Shelly Turner,  Counseling referral coordinator at [email protected] for education on understanding your insurance and how to use it.", "How do I make an  initial appointment?": "New clients are required to complete registration forms in  the Student Counseling Center before they can be scheduled. There is no  appointment necessary to fill out the paperwork. However, we do ask that  students arrive at least an hour before we close to do so.", "Will my parents know if I am receiving services?": "If you are 18 or older, your parents will not have access to  your records, nor will the Student Counseling Center confirm or deny that you  are a client. If you are under 18, you must get permission from your parent(s)  or legal guardian(s) to receive services unless you meet specific  criteria.  Parent(s) or legal guardian(s)  can have access to your records upon request until you turn 18.", "What should I do in  an emergency?": "If you are having a mental health crisis, you are welcome to  utilize our walk-in crisis times, Monday – Friday from 10:00am – 4:00pm. Upon  completion of paperwork, a counselor will review to determine if you meet our  criteria for a same day appointment.  If  you are experiencing a mental health crisis outside of business hours, you may  call the 972-UTD TALK (972-883-8255) 24 hours, 7 days a week to be connected to  a Mental Health Professional over the phone.", "What services does the Student Counseling  Center provide?": "The Student Counseling Center has a wide variety of services  that can be prescribed as part of your individualized treatment plan. These  services include:\r\n      \r\n        Brief individual Counseling (1-6 sessions)\r\n        Single Session Counseling\r\n        Group Counseling\r\n        Couple Counseling\r\n        Healthy U Workshops\r\n        On and Off Campus Referrals\r\n        Psychiatric Services \r\n        Consultation", "How long do you keep my records on file?": "As required by State law, the Student Counseling Center  keeps client records on file for 7 years at which point they are destroyed.", "Do you offer counseling services for alumni?": "Our services are reserved for currently enrolled students at UT Dallas. However, we do have a Referral Coordinator on staff who can provide alumni with referrals in the community if needed."}