{"How do I get assistance after hours?": "Please contact a Peer Advisor, one of the Peer Advisors on call, or one of University Commons' 24-hour front desks.If a student wants/needs help with any kind of emotional distress after hours, they can call the Counseling Center's after hours helpline, \"UTD TALK\" at 972-883-8255.", "How can I get involved in University Housing?": "Residential Life sponsors two student organizations in University Housing:                Residential Housing Association (RHA)        National Residence Housing Honorary (NRHH)                Both organizations provide students with leadership opportunities in the residence halls and apartments.", "Are vehicles allowed on campus?": "Residents may bring a vehicle to campus. Parking decals are required and may be purchased from the Parking Office. The apartments and residence halls have designated parking locations. Visit the parking website for more information.", "Missing Residential Student Policy": "The purpose of this policy is to establish procedures for the university's response to reports of missing residential students as required by the Higher Education Opportunity Act of 2008. This policy applies to all students who live in University Housing. Download the Missing Residential Student Form (pdf).", "What are the dates of my housing agreement?": "All housing agreements are for the complete 2018-19 academic year.", "How does a student reserve a room in University Commons?": "Students may reserve a room in the residence hall in which they reside. Contact Caitlin Wright to make the reservation.", "How does a department reserve a room in University Housing?": "Departments can make a room reservation by contacting Caitlin Wright.", "I am having issues with my roommate. What do I do?": "Talk to your roomate about the issues you are experiencing. If nothing is resolved after speaking to your roommate face-to-face, speak with your Peer Advisor.", "What should I bring?": "Alarm clockBed sheetsThe University Commons residence halls have Twin XL bedsCanyon Creek Heights North has Twin XL bedsCanyon Creek Heights South has full-sized bedsCleaning supplies (toilet cleaner, laundry detergent, dish detergent, etc.)Computer or laptopFirst aid kitPlungerShower curtain/linerSmall tool kit (screwdriver, hammer, a selection of nails and screws, etc.)Toilet paperToiletriesTowelsUniversity Village and Canyon Creek Heights apartment residents should bring kitchen supplies (pots, pans, plates, utensils, can openers, grocery and pantry items, etc.)University Village apartment residents should also bring furniture (bed, couch, dining table, etc.)", "How do I request a housing accommodation based on documented disabilities or medical conditions?": "UT Dallas provides reasonable housing accommodations for students with documented disabilities or medical conditions. If you have a disability and want to request housing accommodations, please visit the Office of Student AccessAbility website.", "Will I have access to all clubhouses, pools and study rooms?": "Yes, residents have access to all clubhouses, pools and study centers in the housing community.", "How can I become a Peer Advisor (PA)?": "The Peer Advisor application process begins at the end of the fall semester, with applications due in January. If you are interested in becoming a PA, contact [email protected]. Check out our Facebook page for details.", "How do I pay my rent?": "All University Housing charges are placed on the resident’s university bill and are paid through the Bursar. Please contact the Bursar for questions about your bill or payments.", "What security measures are in place?": "UT Dallas Police provide frequent patrols throughout University Housing. University Housing management does not assume any legal obligations for personal injury, loss or damage to personal property. You and/or your parents are encouraged to carry appropriate insurance to cover such losses.Anyone with a cell phone can register via Galaxy to receive text alerts in the event of an emergency or disruption to normal university operations.For sexual assault emergencies after business hours, please call the 24-hour rape crisis hotline at 972-641-7273. You will be connected with a sexual assault advocate from the Dallas Area Rape Crisis Center.Sexual Assault Recovery Services", "How does a student organization reserve a room in University Housing?": "Registered student organizations can reserve the Residence Hall South Classroom, Residence Hall South Multipurpose Room, and Residence Hall South Rotunda. Student organizations must make the reservation through the UT Dallas Room Reservation System.", "How do I set up a roommate agreement?": "At the beginning of each academic year, Peer Advisors will coordinate with residents to complete a roommate agreement for the apartment/suite/room. If a new resident moves in, Peer Advisors will work with the student to set up or reevaluate the roommate agreement as necessary.", "What is a roommate agreement?": "A roommate agreement is a document all members of the apartment/suite/room abide by during their time living in the space. Contents of the agreement are determined by the roommates and cover multiple areas, including cleaning tasks, taking out the trash and guest policies.", "What dining options are available?": "Visit UT Dallas Dining Services for information about dining on campus."}